#### Practice 3

In [2]:
import pandas as pd
import numpy as np

In [3]:
index = pd.date_range("1/1/2000", periods=8)
s = pd.Series(np.random.randn(5), index=["a", "b", "c", "d", "e"])
df = pd.DataFrame(np.random.randn(8, 3), index=index, columns=["A", "B", "C"])

In [3]:
long_series = pd.Series(np.random.randn(1000))
long_series.head()

0    1.804950
1    1.206510
2   -1.051682
3    0.983850
4    0.184830
dtype: float64

In [4]:
long_series.tail(3)

997   -0.038091
998   -0.027772
999   -0.455768
dtype: float64

In [5]:
df[:2]

                  A         B         C
2000-01-01 -0.11295  0.393846  0.014863
2000-01-02  0.06904  0.734596  0.530700

In [7]:
df.columns = [x.lower() for x in df.columns]
df

                   a         b         c
2000-01-01 -0.112950  0.393846  0.014863
2000-01-02  0.069040  0.734596  0.530700
2000-01-03 -0.157362 -1.382654  0.439628
2000-01-04 -0.005803  1.531040 -2.528470
2000-01-05  0.436742  2.300288 -1.093177
2000-01-06  0.180556  0.817886  0.764568
2000-01-07 -1.058720 -0.976802  0.032580
2000-01-08  0.439498  0.973625  0.981510

In [35]:
df = pd.DataFrame(
    {
        "one": pd.Series(np.random.randn(3), index=["a", "b", "c"]),
        "two": pd.Series(np.random.randn(4), index=["a", "b", "c", "d"]),
        "three": pd.Series(np.random.randn(3), index=["b", "c", "d"]),
    }
)
df

        one       two     three
a  0.014333  1.121930       NaN
b -0.272018 -0.762727  1.263895
c -0.557028  2.230304  0.134520
d       NaN  0.124350 -0.997970

In [18]:
row = df.iloc[1]
column = df["two"]
df.sub(row, axis="columns")

        one       two     three
a -2.341991 -0.675281       NaN
b  0.000000  0.000000  0.000000
c  0.355037 -0.946057  1.501141
d       NaN -1.891478  1.067776

In [19]:
row

one      0.048324
two      1.323226
three   -1.738972
Name: b, dtype: float64

In [20]:
tips_df = pd.read_csv('../datasets/tips.csv')
tips_df

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [22]:
type(tips_df.total_bill)

pandas.core.series.Series

In [23]:
tips_df.head(6)

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4
5       25.29  4.71    Male     No  Sun  Dinner     4

In [24]:
tips_df.tail(8)

     total_bill   tip     sex smoker   day    time  size
236       12.60  1.00    Male    Yes   Sat  Dinner     2
237       32.83  1.17    Male    Yes   Sat  Dinner     2
238       35.83  4.67  Female     No   Sat  Dinner     3
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

In [25]:
tips_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    object
 3   smoker      244 non-null    object
 4   day         244 non-null    object
 5   time        244 non-null    object
 6   size        244 non-null    int64
dtypes: float64(2), int64(1), object(4)
memory usage: 13.5+ KB

In [26]:
tips_df.describe()

       total_bill         tip        size
count  244.000000  244.000000  244.000000
mean    19.785943    2.998279    2.569672
std      8.902412    1.383638    0.951100
min      3.070000    1.000000    1.000000
25%     13.347500    2.000000    2.000000
50%     17.795000    2.900000    2.000000
75%     24.127500    3.562500    3.000000
max     50.810000   10.000000    6.000000

In [33]:
tips_df.loc[[6,7,9,0]]

   total_bill   tip     sex smoker  day    time  size
6        8.77  2.00    Male     No  Sun  Dinner     2
7       26.88  3.12    Male     No  Sun  Dinner     4
9       14.78  3.23    Male     No  Sun  Dinner     2
0       16.99  1.01  Female     No  Sun  Dinner     2

In [ ]:
tips_df.iloc

In [36]:
(df > 0).all()

one      False
two      False
three    False
dtype: bool

In [39]:
(df > 0).any()

one      True
two      True
three    True
dtype: bool

In [44]:
(df > 0).any().any()

np.True_

In [45]:
df.empty

False

In [47]:
df + df==df * 2

     one   two  three
a   True  True  False
b   True  True   True
c   True  True   True
d  False  True   True